app/controllers/songs_controller.rb

  def show
    if params[:artist_id]
      @artist = Artist.find(params[:artist_id])
        if @artist.nil?
          redirect_to artists_path, alert: "Artist not found"
        end
      @song = @artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 9], ["LIMIT", 1]]